Repository: Dumitrel13/OnlineCatalog
Catalog: OnlineCatalog/Resources/SharedResources.*.resx
Languages: ro

source: 2fa has been disabled. You can reenable 2fa when you setup an authenticator app
ro: 2fa a fost dezactivat. Puteți reactiva 2fa atunci când configurați o aplicație de autentificare

source: A final grade already exists for this subject!
ro: O notă de tip teză deja există pentru această materie!

source: A rating was already added, you cannot add another one!
ro: Un calificativ a fost adăugat deja, nu mai poți adăuga încă unul!

source: Absences
ro: Absențe

source: Actions
ro: Acțiuni

source: Add
ro: Adaugă

source: Add a new absence
ro: Adaugă o nouă absență

source: Add a new assignment
ro: Adaugă o nouă sarcină

source: Add a new classroom
ro: Adaugă o nouă clasă

source: Add a new message
ro: Adaugă un nou mesaj

source: Add a new pupil
ro: Adaugă un nou elev

source: Add a new role
ro: Adaugă un nou rol

source: Add a new specialization
ro: Adaugă o nouă specializare

source: Add a new subject
ro: Adaugă o nouă materie

source: Add a new teacher
ro: Adaugă un nou profesor

source: Add authenticator app
ro: Adaugă aplicația autentificator

source: Add absence
ro: Adaugă absență

source: Add a new year structure
ro: Adaugă o nouă structură a anului

source: Add assignment
ro: Adaugă sarcină

source: Add classroom
ro: Adaugă clasa

source: Add grade
ro: Adaugă notă

source: Add kids
ro: Adaugă copiii

source: Add message
ro: Adaugă mesaj

source: Add new period
ro: Adaugă o nouă perioadă

source: Add parent
ro: Adaugă părinte

source: Add pupil
ro: Adaugă elev

source: Add pupils
ro: Adaugă elevii

source: Address
ro: Adresă

source: Add role
ro: Adaugă rol

source: Add specialization
ro: Adaugă specializare

source: Add subject
ro: Adaugă materie

source: Add subjects
ro: Adaugă materii

source: Add teacher
ro: Adaugă profesor

source: Admin options
ro: Opțiuni administrator

source: Allow exam
ro: Acceptă teză

source: An error occurred while processing your request.
ro: A apărut o eroare la procesarea cererii.

source: and
ro: și

source: Are you sure you want to delete this classroom
ro: Ești sigur că vrei să ștergi această clasă

source: Are you sure you want to delete this subject
ro: Ești sigur că vrei să ștergi această materie

source: Are you sure you want to promote all classrooms
ro: Ești sigur că vrei să promovezi toate clasele

source: Assign
ro: Asignează

source: Assigned pupils
ro: Copiii asignați

source: Assignments
ro: Sarcini

source: Assign pupils
ro: Asignează elevi

source: Assign subjects
ro: Asignează materii

source: Authenticator app
ro: Aplicație de autentificare

source: Available subjects
ro: Materii disponibile

source: Back
ro: Înapoi

source: before you can log in with a recovery code
ro: înainte de a te putea conecta cu un astfel de cod

source: Calculate final grade
ro: Calculatează media finală

source: Calculate final grade for subject
ro: Calculează media finală pentru materia

source: Change email
ro: Schimbă adresa de email

source: Change password
ro: Schimbă parola

source: Change your account settings
ro: Modifică setările contului tău

source: Classroom
ro: Clasă

source: click here to log in
ro: Apasă aici pentru a te conecta.

source: Code
ro: Cod

source: Configure authenticator app
ro: Configurați aplicația de autentificare

source: Confirm
ro: Confirmă

source: Confirm email
ro: Confirm adresa de email

source: Confirmation link to change email sent. Please check your email.
ro: Un link de confirmare pentru schimbarea adresei de email a fost trimis. Te rog verifica email-ul.

source: Confirm password
ro: Confirmă parola

source: Content
ro: Conținut

# ContentErrorMessage
source: The content must have between 10 and 200 chars
ro: Conținutul trebuie să fie între 10 și 200 de caractere!

source: Create an account
ro: Crează un cont

source: Current role:
ro: Rolul curent:

source: Current subject:
ro: Materia curentă:

source: Date
ro: Dată

source: Delete
ro: Șterge

source: Delete user
ro: Șterge utilizator

source: Delete year structure
ro: Șterge stuctura anului școlar

source: Deleting this data will permanently remove your account, and this cannot be recovered
ro: Ștergerea acestor date vă va elimina definitiv contul, iar acest lucru nu poate fi recuperat

source: Details
ro: Detalii

source: Disable
ro: Dezactivează

source: Disable two-factor authentication
ro: Dezactivează autentificarea cu factori multipli

source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
ro: Dezactivarea 2FA nu schimbă cheile utilizate în aplicațiile de autentificare. Dacă doriți să schimbați cheia utilizată într-o aplicație de autentificare, trebuie

source: Display classrooms
ro: Afișează clase

source: Display my kids scholar situation
ro: Afișează situația școlară a copiilor mei

source: Display my scholar information
ro: Afișează informațiile mele școlare

source: Display parents
ro: Afișează părinții

# DisplayPupils
source: Display pupil
ro: Afișează elevi

source: Display roles
ro: Afișează roluri

source: Display school details
ro: Afișează detaliile școlii

source: Display specializations
ro: Afișează specializări

source: Display subjects
ro: Afișează materii

source: Display teachers
ro: Afișează profesori

source: Display year structures
ro: Afișează structurile anilor școlari

source: Don't have access to your authenticator device? You can
ro: Nu aveți acces la dispozitivul dvs. de autentificare? Puteți

source: Download
ro: Descarcă

source: Download a two-factor authenticator app like
ro: Descărcați o aplicație de autentificare cu factori multipli cum ar fi

source: Download file
ro: Descarcă fișierul

source: Edit
ro: Editează

source: Edit assignment
ro: Editează sarcina

source: Edit classroom
ro: Editează clasa

source: Edit grade
ro: Modifică nota

source: Edit pupil
ro: Editare elev

source: Edit teacher
ro: Editare profesor

source: Ending date
ro: Dată sfârșit

source: Ending year
ro: Sfârșit de an

source: Enter your email
ro: Introdu adresa de email

source: Error
ro: Eroare

source: Error confirming your email.
ro: Eroare la confirmarea adresei de email.

source: Exam grade
ro: Notă teză

source: Failed to send the message!
ro: Mesajul nu a putut fi trimis!

source: Final grade
ro: Media finală

source: First name
ro: Prenume

source: for
ro: pentru

source: Forget this browser
ro: Uită acest browser

source: Forgot password confirmation
ro: Confirmare parolă uitată

source: Forgot your password
ro: Ai uitat parola

source: From
ro: De la

source: Full name
ro: Nume complet

source: Gender
ro: Gen

source: Generate (2FA) recovery codes
ro: Generați coduri de recuperare

source: generate a new set of recovery codes
ro: sa generezi un nou set de coduri de recuperare

source: Generate two-factor authentication (2FA) recovery codes
ro: Generați coduri de recuperare pentru autentificarea cu factori multipli

source: Generating new recovery codes does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
ro: Generarea de noi coduri de recuperare nu schimbă cheile utilizate în aplicațiile de autentificare. Dacă doriți să schimbați cheia utilizată într-o aplicație de autentificare, trebuie

source: Grade
ro: Notă

# GradeClassroom
source: Grade
ro: An clasă

source: Grades
ro: Note

source: Grade type
ro: Tipul notei

source: Group
ro: Grupă

source: Hello
ro: Bună

source: If you do not complete your authenticator app configuration you may lose access to your account.
ro: Dacă nu completați configurația aplicației de autentificare, puteți pierde accesul la contul dvs.

source: If you lose your device and don't have the recovery codes you will lose access to your account.
ro: Dacă pierdeți dispozitivul și nu aveți codurile de recuperare, veți pierde accesul la contul dvs.

source: If you reset your authenticator key your authenticator app will not work until you reconfigure it.
ro: Dacă resetați cheia de autentificare, aplicația dvs. de autentificare nu va funcționa până când o reconfigurați.

source: into your two factor authenticator app. Spaces and casing do not matter.
ro: în aplicația dvs. de autentificare cu factori multipli. Spațiile nu contează.

source: Invalid authenticator code.
ro: Cod de autentificare invalid.

source: Invalid login attempt.
ro: Încercare de autentificare invalidă.

source: Is active
ro: Este activ

source: Is principal
ro: Este director

source: Justified
ro: Motivată

source: Justify absence
ro: Motivează absența

source: Justify absences
ro: Motivează absențe

source: Last name
ro: Nume

source: Log in
ro: Autentificare

source: log in with a recovery code
ro: să vă conectați cu un cod de recuperare

source: Login
ro: Conectează-te

source: Manage Email
ro: Gestionează adresa de email

source: Manage your account
ro: Administrează contul tău

source: Menu
ro: Meniu

source: Message send!
ro: Mesajul a fost trimis!

source: Message details
ro: Detalii mesaj

source: Messages
ro: Mesaje

source: Messages regarding
ro: Mesaje cu privire la

source: Name
ro: Nume

source: New parent account
ro: Cont nou de părinte

source: New teacher account
ro: Cont nou de profesor

source: New email
ro: Email nou

source: New password
ro: Parola nouă

source: No school registered yet!
ro: Nici o școală nu a fost înregistrată încă!

source: No values were added!
ro: Nu au fost adăugate date suficiente!

source: Old password
ro: Parola veche

source: Once you have scanned the QR code or input the key above, your two factor authentication app will provide you with a unique code. Enter the code in the confirmation box below.
ro: După ce ați scanat codul QR sau introduceți cheia de mai sus, aplicația dvs. de autentificare cu factori multipli vă va oferi un cod unic. Introduceți codul în caseta de confirmare de mai jos.

source: Online catalog
ro: Catalog online

source: or
ro: sau

source: Parent
ro: Părinte

source: Parent options
ro: Opțiuni părinte

source: Password
ro: Parolă

source: Period title
ro: Titlul perioadei

source: Personal data
ro: Date personale

source: Phone number
ro: Număr de telefon

source: Please check your email to reset your password.
ro: Verifică adresa de email pentru a reseta parola.

source: Please enter a value for this field!
ro: Introdu o valoare pentru acest câmp!

source: Please select a file!
ro: Selectează un fișier!

source: Principal options
ro: Opțiuni director

source: Privacy and cookie policy have not been accepted
ro: Politica de confidențialitate și de utilizare a cookie-urilor nu a fost acceptată

source: Profile
ro: Profil

source: Promote classrooms
ro: Promovează clasele

source: Pupil
ro: Elev

source: Pupil's full name
ro: Numele complet al elevului

source: Pupil options
ro: Opțiuni elev

source: Pupils
ro: Elevi

source: Pupils of this classroom
ro: Elevii acestei clase

source: Put these codes in a safe place.
ro: Stocați aceste coduri într-un loc sigur.

source: Read messages
ro: Mesaje citite

source: Recovery codes
ro: Coduri de recuperare

source: recovery codes left
ro: coduri de recuperare rămase

source: Regarding
ro: Cu privire la

source: Register
ro: Inregistrează-te

source: Register a new school
ro: Înregistrează o nouă școală

source: Register school
ro: Înregistrează școala

source: Remember me
ro: Ține-mă minte

source: Remove
ro: Elimină

source: Remove kid from list
ro: Elimină elevul din listă

source: Remove subject from list
ro: Elimină materia din listă

source: Resend
ro: Retrimite

source: Resend email confirmation
ro: Retrimiteți confirmarea prin email

source: Reset
ro: Resetează

source: Reset authenticator app
ro: Resetează aplicația autentificator

source: Reset authenticator key
ro: Resetați cheia autentificatorului

source: Reset Password
ro: Resetează parola

source: Reset password confirmation
ro: Confirmare resetare parolă

source: Reset recovery codes
ro: Resetează codurile de recuperare

source: reset your authenticator keys
ro: să schimbați cheile de autentificare

source: Role
ro: Rol

source: Roles
ro: Roluri

source: Save
ro: Salvează

source: Save changes
ro: Salvează schimbările

source: Scan the QR Code or enter this key
ro: Scanați codul QR sau introduceți această cheie

source: School details
ro: Detaliile școlii

source: Score
ro: Notă

source: Select a classroom
ro: Selectează o clasă

source: Select a role
ro: Selectează un rol

source: Select a subject
ro: Selectează o materie

source: Selected pupil
ro: Elevul selectat

source: Select gender
ro: Selectează genul

source: Select photo
ro: Alege imagine

source: Send verification email
ro: Trimite email de confirmare

source: Send message
ro: Trimite mesaj

source: Set up authenticator app
ro: Configurează aplicația autentificator

source: Starting date
ro: Dată început

source: Starting year
ro: Început de an

source: State
ro: Stare

source: Subject
ro: Materie

# SubjectHours
source: Subject hours per week
ro: Ore materie pe saptamana

source: Subjects
ro: Materii

source: Teacher's full name
ro: Numele complet al profesorului

source: Teacher details
ro: Detalii profesor

source: Teacher options
ro: Opțiuni profesor

source: Teachers
ro: Profesori

source: Thank you for confirming your email.
ro: Mulțumim că ai confirmat adresa de email.

source: The current browser has been forgotten. When you login again from this browser you will be prompted for your 2fa code.
ro: Browserul curent a fost uitat. Când vă conectați din nou de la acest browser, vi se va solicita codul 2fa.

source: The password and confirmation password do not match.
ro: Parola și confirmarea acesteia nu se potrivesc.

source: The password is randomly generated!
ro: Parola este generată aleatoriu!

source: The type of the selected score does not match the type of the existing grades!
ro: Tipul notei selectat nu se potrivește cu tipul notelor deja existente!

source: The {0} must be at least {2} and at max {1} characters long.
ro: Parola trebuie să conțină între {2} și {1} caractere

# TheSubjectsOfTheClass
source: The subjects of the classroom
ro: Materiile acestei clase

source: This action only disables
ro: Această acțiune doar dezactivează

source: This process disables 2FA until you verify your authenticator app.
ro: Acest proces dezactivează 2FA până când verificați aplicația de autentificare.

source: This pupil has no grades!
ro: Acest elev nu are note!

# Title
source: Name
ro: Titlu

source: To
ro: Pâna la

source: To use an authenticator app go through the following steps
ro: Pentru a utiliza o aplicație de autentificare parcurgeți pașii următori

source: Towards
ro: Către

source: Two-factor authentication
ro: Autentificare cu factori multipli

source: Unasigned pupils
ro: Elevi neasignati

source: Unjustified
ro: Nemotivată

source: Unread messages
ro: Mesaje necitite

source: Update password
ro: Schimbă parola

source: Username
ro: Nume utilizator

source: Verification Code
ro: Codul de verificare

source: Verification email sent. Please check your email.
ro: Email de confirmare trimis. Te rog verifică adresa de email.

source: Verify
ro: Verifică

source: View
ro: Vizualizează

source: View assigned pupils
ro: Vizualizează elevii asignați

source: View assigned subjects
ro: Vizualizează materiile asignate

source: View messages
ro: Vizualizează mesaje

source: View pupils
ro: Vizualizează elevii

source: View teachers
ro: Vizualizează profesorii

source: Welcome
ro: Bun venit!

source: Year of the structure
ro: Anul structurii anului școlar

# YearStructures
source: Years structures
ro: Structurile anilor școlari

source: You can
ro: Poți

source: You cannot calculate the final grade because this subject has no grades!
ro: Nu poți calcula nota finală deoarece nu există note pentru această materie!

source: You have
ro: Ai

source: You have 1 recovery code left
ro: Ai un singur cod de recuperare rămas

source: You have generated new recovery codes.
ro: Ați generat noi coduri de recuperare.

source: You have no recovery codes left
ro: Nu ai nici un cod de recuperare

source: You must
ro: Trebuie

source: You must accept the policy before you can enable two factor authentication
ro: Trebuie să acceptați politica înainte de a putea activa autentificarea cu factori multipli

source: You should
ro: Ar trebui

source: Your account contains personal data that you have given us. This page allows you to download or delete that data
ro: Contul dvs. conține date personale pe care ni le-ați oferit. Această pagină vă permite să descărcați sau să ștergeți datele respective

source: Your authenticator app key has been reset, you will need to configure your authenticator app using the new key.
ro: Cheia aplicației dvs. de autentificare a fost resetată, va trebui să configurați aplicația de autentificare folosind noua cheie.

source: Your email is unchanged.
ro: Adresa de email este neschimbata.

source: Your login is protected with an authenticator app. Enter your authenticator code below
ro: Autentificare dvs. este protejată cu o aplicație de autentificare. Introduceți codul de autentificare mai jos

source: Your password has been changed.
ro: Parola ta a fost schimbată.

source: Your password has been reset. Please
ro: Parola a fost resetată.
